app/views/posts/show.html.haml

			Comments in Thread -
			= @post.comments.count
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 10]]