app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)
    @post = current_user.posts.build(post_params)

		if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "das"], ["content", "asdhkj"], ["created_at", "2015-06-20 01:33:44.594225"], ["updated_at", "2015-06-20 01:33:44.594225"]]